//
//  Tasks.swift
//  TasksBook
//
//  Created by Юрий Куринной on 30.09.2022.
//

import Foundation

var tasks = [
    "Посчитать сумму всех чисел в массиве [1, 2, 5, 7]" : "(reduce)",
    "Сравнить два массива: [1, 3, 12] и [1, 12, 3]" : "(Set, isSubset)",
    "Удалить все 'nil' из массива: [1, 2, 5, nil, 23, 78, nil, nil, 2]" : "(compactMap)",
    "Перевести предложение 'My favourite programming language is Swift' в массив слов" : "(components)",
    "Удалить из предложения 'My favourite programming language is Swift' все буквы а, о, u" : "(removeAll, contains)",
    "Написать функцию для расчета средеарифметического значения массива чисел любой величины c печатью результата" : "(add var + for in)",
    "Написать функцию, принимающую массив чисел и возвращающую кортеж с указанием минимального и максимального числа массива, проходящую проверку пустым массивом. Сделать вычисляемое свойство, распечатывающее фразу с указанием минимального и максимального числа" : "(min & max, return nil)",
    "Переписать массив чисел использую функцию inout, увеличив все значения на 1" : "(a: inout Int)",
    "С помощью многомерного массива нарисовать шахматное поле, заполненное нулями, расположить на нем ферзя, обозначить ферзя цифрой 2, а возможные линии атаки цифрой 1" : "(repeating, count, forEach, enumerated)",
    "Написать функцию, меняющую значения между двумя переменными, затем распечатать новые значения" : "(swap values (inout)"
]


